[
    {
        "_id": "B0CMCTYMDV__0",
        "asin": "B0CMCTYMDV",
        "deal_id": "",
        "title": "Sperax Walking Pad, 3 in 1 Under Desk Treadmill, Treadmills for Home",
        "discountInfo": "80% off",
        "productLink": "https://www.amazon.ca/Sperax-Walking-Under-Treadmill-Treadmills/dp/B0CMCTYMDV?ref=dlx_deals_dg_dcl_B0CMCTYMDV_dt_sl14_f7&pf_rd_r=EBY3542VGGFJF09YVBNA&pf_rd_p=df8509bd-da04-4f0b-a4cb-a9b8a96d5cf7",
        "imageSources": [
            "https://m.media-amazon.com/images/I/61WxsHo3Y7L._AC_SF226,226_QL85_.jpg?aicid=discounts-widgets-horizonte"
        ],
        "description": [
            "The Sperax Walking Pad, 3 in 1 Under Desk Treadmill, Treadmills for Home is an exceptional product designed to meet your needs and exceed expectations. With a focus on innovation and performance, this product offers unparalleled features that enhance your everyday experience. Whether it's functionality, style, or cutting-edge technology, the Sperax Walking Pad, 3 in 1 Under Desk Treadmill, Treadmills for Home delivers on all fronts.",
            "This product is crafted with precision, ensuring quality and durability. Its advanced capabilities make it a versatile choice, suitable for a variety of uses. With a sleek design and intuitive functionality, the Sperax Walking Pad, 3 in 1 Under Desk Treadmill, Treadmills for Home integrates seamlessly into your lifestyle. Explore endless possibilities with its user-friendly interface and reliable performance.",
            "The Sperax Walking Pad, 3 in 1 Under Desk Treadmill, Treadmills for Home stands out not only for its features but also for its commitment to sustainability and user satisfaction. Whether you’re at home, in the office, or on the go, this product adapts effortlessly to your environment. It's more than just a product—it's an investment in quality, convenience, and innovation."
        ]
    },
    {
        "_id": "B079K9B4XV__1",
        "asin": "B079K9B4XV",
        "deal_id": "",
        "title": "Dyson V7 Advanced Cordless Vacuum",
        "discountInfo": "40% off",
        "productLink": "https://www.amazon.ca/Dyson-Animal-Cordless-Vacuum-Cleaner/dp/B079K9B4XV?ref=dlx_deals_dg_dcl_B079K9B4XV_dt_sl14_f7&pf_rd_r=EBY3542VGGFJF09YVBNA&pf_rd_p=df8509bd-da04-4f0b-a4cb-a9b8a96d5cf7",
        "imageSources": [
            "https://m.media-amazon.com/images/I/51uoxQA8CTL._AC_SF226,226_QL85_.jpg?aicid=discounts-widgets-horizonte"
        ],
        "description": [
            "The Dyson V7 Advanced Cordless Vacuum is an exceptional product designed to meet your needs and exceed expectations. With a focus on innovation and performance, this product offers unparalleled features that enhance your everyday experience. Whether it's functionality, style, or cutting-edge technology, the Dyson V7 Advanced Cordless Vacuum delivers on all fronts.",
            "This product is crafted with precision, ensuring quality and durability. Its advanced capabilities make it a versatile choice, suitable for a variety of uses. With a sleek design and intuitive functionality, the Dyson V7 Advanced Cordless Vacuum integrates seamlessly into your lifestyle. Explore endless possibilities with its user-friendly interface and reliable performance.",
            "The Dyson V7 Advanced Cordless Vacuum stands out not only for its features but also for its commitment to sustainability and user satisfaction. Whether you’re at home, in the office, or on the go, this product adapts effortlessly to your environment. It's more than just a product—it's an investment in quality, convenience, and innovation."
        ]
    },
    {
        "_id": "B0D1FL58FX__2",
        "asin": "B0D1FL58FX",
        "deal_id": "",
        "title": "Electric Spin Scrubber, Cordless Bathroom Shower Cleaner, Cleaning Brush with 9 Brush Heads 2H Power Dual Speed, Adjustable Extension Handle, IPX7 Waterproof for Tub Tile Floor Car A,White-1.",
        "discountInfo": "88% off",
        "productLink": "https://www.amazon.ca/Electric-Scrubber-Adjustable-Extension-Waterproof/dp/B0D1FL58FX?ref=dlx_deals_dg_dcl_B0D1FL58FX_dt_sl14_f7&pf_rd_r=EBY3542VGGFJF09YVBNA&pf_rd_p=df8509bd-da04-4f0b-a4cb-a9b8a96d5cf7",
        "imageSources": [
            "https://m.media-amazon.com/images/I/71W3ovyYI6L._AC_SF226,226_QL85_.jpg?aicid=discounts-widgets-horizonte"
        ],
        "description": [
            "The Electric Spin Scrubber, Cordless Bathroom Shower Cleaner, Cleaning Brush with 9 Brush Heads 2H Power Dual Speed, Adjustable Extension Handle, IPX7 Waterproof for Tub Tile Floor Car A,White-1. is an exceptional product designed to meet your needs and exceed expectations. With a focus on innovation and performance, this product offers unparalleled features that enhance your everyday experience. Whether it's functionality, style, or cutting-edge technology, the Electric Spin Scrubber, Cordless Bathroom Shower Cleaner, Cleaning Brush with 9 Brush Heads 2H Power Dual Speed, Adjustable Extension Handle, IPX7 Waterproof for Tub Tile Floor Car A,White-1. delivers on all fronts.",
            "This product is crafted with precision, ensuring quality and durability. Its advanced capabilities make it a versatile choice, suitable for a variety of uses. With a sleek design and intuitive functionality, the Electric Spin Scrubber, Cordless Bathroom Shower Cleaner, Cleaning Brush with 9 Brush Heads 2H Power Dual Speed, Adjustable Extension Handle, IPX7 Waterproof for Tub Tile Floor Car A,White-1. integrates seamlessly into your lifestyle. Explore endless possibilities with its user-friendly interface and reliable performance.",
            "The Electric Spin Scrubber, Cordless Bathroom Shower Cleaner, Cleaning Brush with 9 Brush Heads 2H Power Dual Speed, Adjustable Extension Handle, IPX7 Waterproof for Tub Tile Floor Car A,White-1. stands out not only for its features but also for its commitment to sustainability and user satisfaction. Whether you’re at home, in the office, or on the go, this product adapts effortlessly to your environment. It's more than just a product—it's an investment in quality, convenience, and innovation."
        ]
    },
    {
        "_id": "B0CQN248PX__3",
        "asin": "B0CQN248PX",
        "deal_id": "",
        "title": "Amazon Fire TV Stick HD, free and live TV, Alexa Voice Remote, smart home controls, HD streaming",
        "discountInfo": "50% off",
        "productLink": "https://www.amazon.ca/amazon-fire-tv-stick-hd/dp/B0CQN248PX?ref=dlx_deals_dg_dcl_B0CQN248PX_dt_sl14_f7&pf_rd_r=EBY3542VGGFJF09YVBNA&pf_rd_p=df8509bd-da04-4f0b-a4cb-a9b8a96d5cf7",
        "imageSources": [
            "https://m.media-amazon.com/images/I/61qQCckVsqL._AC_SF226,226_QL85_.jpg?aicid=discounts-widgets-horizonte"
        ],
        "description": [
            "The Amazon Fire TV Stick HD, free and live TV, Alexa Voice Remote, smart home controls, HD streaming is an exceptional product designed to meet your needs and exceed expectations. With a focus on innovation and performance, this product offers unparalleled features that enhance your everyday experience. Whether it's functionality, style, or cutting-edge technology, the Amazon Fire TV Stick HD, free and live TV, Alexa Voice Remote, smart home controls, HD streaming delivers on all fronts.",
            "This product is crafted with precision, ensuring quality and durability. Its advanced capabilities make it a versatile choice, suitable for a variety of uses. With a sleek design and intuitive functionality, the Amazon Fire TV Stick HD, free and live TV, Alexa Voice Remote, smart home controls, HD streaming integrates seamlessly into your lifestyle. Explore endless possibilities with its user-friendly interface and reliable performance.",
            "The Amazon Fire TV Stick HD, free and live TV, Alexa Voice Remote, smart home controls, HD streaming stands out not only for its features but also for its commitment to sustainability and user satisfaction. Whether you’re at home, in the office, or on the go, this product adapts effortlessly to your environment. It's more than just a product—it's an investment in quality, convenience, and innovation."
        ]
    },
    {
        "_id": "B0851RW2D8__4",
        "asin": "B0851RW2D8",
        "deal_id": "",
        "title": "VOVO VB-3100SR Round Bidet Toilet Seat, Warm Water, LED Light, Heated Seat, White, Dryer, Stainless Steel Nozzle, Made in Korea",
        "discountInfo": "29% off",
        "productLink": "https://www.amazon.ca/VOVO-VB3100SR-Electronic-Nightlight-Stainless/dp/B0851RW2D8?ref=dlx_deals_dg_dcl_B0851RW2D8_dt_sl14_f7&pf_rd_r=EBY3542VGGFJF09YVBNA&pf_rd_p=df8509bd-da04-4f0b-a4cb-a9b8a96d5cf7",
        "imageSources": [
            "https://m.media-amazon.com/images/I/61c03LzmCoL._AC_SF226,226_QL85_.jpg?aicid=discounts-widgets-horizonte"
        ],
        "description": [
            "The VOVO VB-3100SR Round Bidet Toilet Seat, Warm Water, LED Light, Heated Seat, White, Dryer, Stainless Steel Nozzle, Made in Korea is an exceptional product designed to meet your needs and exceed expectations. With a focus on innovation and performance, this product offers unparalleled features that enhance your everyday experience. Whether it's functionality, style, or cutting-edge technology, the VOVO VB-3100SR Round Bidet Toilet Seat, Warm Water, LED Light, Heated Seat, White, Dryer, Stainless Steel Nozzle, Made in Korea delivers on all fronts.",
            "This product is crafted with precision, ensuring quality and durability. Its advanced capabilities make it a versatile choice, suitable for a variety of uses. With a sleek design and intuitive functionality, the VOVO VB-3100SR Round Bidet Toilet Seat, Warm Water, LED Light, Heated Seat, White, Dryer, Stainless Steel Nozzle, Made in Korea integrates seamlessly into your lifestyle. Explore endless possibilities with its user-friendly interface and reliable performance.",
            "The VOVO VB-3100SR Round Bidet Toilet Seat, Warm Water, LED Light, Heated Seat, White, Dryer, Stainless Steel Nozzle, Made in Korea stands out not only for its features but also for its commitment to sustainability and user satisfaction. Whether you’re at home, in the office, or on the go, this product adapts effortlessly to your environment. It's more than just a product—it's an investment in quality, convenience, and innovation."
        ]
    },
    {
        "_id": "B0C2J8KJH9__5",
        "asin": "B0C2J8KJH9",
        "deal_id": "",
        "title": "Dyson V15 Detect™ Cordless Vacuum",
        "discountInfo": "25% off",
        "productLink": "https://www.amazon.ca/Dyson-V15-DetectTM-Cordless-Vacuum/dp/B0C2J8KJH9?ref=dlx_deals_dg_dcl_B0C2J8KJH9_dt_sl14_f7&pf_rd_r=EBY3542VGGFJF09YVBNA&pf_rd_p=df8509bd-da04-4f0b-a4cb-a9b8a96d5cf7",
        "imageSources": [
            "https://m.media-amazon.com/images/I/619XJLzSXJL._AC_SF226,226_QL85_.jpg?aicid=discounts-widgets-horizonte"
        ],
        "description": [
            "The Dyson V15 Detect™ Cordless Vacuum is an exceptional product designed to meet your needs and exceed expectations. With a focus on innovation and performance, this product offers unparalleled features that enhance your everyday experience. Whether it's functionality, style, or cutting-edge technology, the Dyson V15 Detect™ Cordless Vacuum delivers on all fronts.",
            "This product is crafted with precision, ensuring quality and durability. Its advanced capabilities make it a versatile choice, suitable for a variety of uses. With a sleek design and intuitive functionality, the Dyson V15 Detect™ Cordless Vacuum integrates seamlessly into your lifestyle. Explore endless possibilities with its user-friendly interface and reliable performance.",
            "The Dyson V15 Detect™ Cordless Vacuum stands out not only for its features but also for its commitment to sustainability and user satisfaction. Whether you’re at home, in the office, or on the go, this product adapts effortlessly to your environment. It's more than just a product—it's an investment in quality, convenience, and innovation."
        ]
    },
    {
        "_id": "B0B1N56YXG__6",
        "asin": "B0B1N56YXG",
        "deal_id": "",
        "title": "Blink Outdoor 4 – Wireless smart security camera, two-year battery, 1080p HD day and infrared night live view, two-way talk – 3 camera system",
        "discountInfo": "50% off",
        "productLink": "https://www.amazon.ca/Blink-Outdoor-4th-Gen-3-Camera/dp/B0B1N56YXG?ref=dlx_deals_dg_dcl_B0B1N56YXG_dt_sl14_f7&pf_rd_r=EBY3542VGGFJF09YVBNA&pf_rd_p=df8509bd-da04-4f0b-a4cb-a9b8a96d5cf7",
        "imageSources": [
            "https://m.media-amazon.com/images/I/41PtM0usvoL._AC_SF226,226_QL85_.jpg?aicid=discounts-widgets-horizonte"
        ],
        "description": [
            "The Blink Outdoor 4 – Wireless smart security camera, two-year battery, 1080p HD day and infrared night live view, two-way talk – 3 camera system is an exceptional product designed to meet your needs and exceed expectations. With a focus on innovation and performance, this product offers unparalleled features that enhance your everyday experience. Whether it's functionality, style, or cutting-edge technology, the Blink Outdoor 4 – Wireless smart security camera, two-year battery, 1080p HD day and infrared night live view, two-way talk – 3 camera system delivers on all fronts.",
            "This product is crafted with precision, ensuring quality and durability. Its advanced capabilities make it a versatile choice, suitable for a variety of uses. With a sleek design and intuitive functionality, the Blink Outdoor 4 – Wireless smart security camera, two-year battery, 1080p HD day and infrared night live view, two-way talk – 3 camera system integrates seamlessly into your lifestyle. Explore endless possibilities with its user-friendly interface and reliable performance.",
            "The Blink Outdoor 4 – Wireless smart security camera, two-year battery, 1080p HD day and infrared night live view, two-way talk – 3 camera system stands out not only for its features but also for its commitment to sustainability and user satisfaction. Whether you’re at home, in the office, or on the go, this product adapts effortlessly to your environment. It's more than just a product—it's an investment in quality, convenience, and innovation."
        ]
    },
    {
        "_id": "B0CG6NR413__7",
        "asin": "B0CG6NR413",
        "deal_id": "",
        "title": "Garmin vívoactive 5, Health and Fitness GPS Smartwatch, AMOLED Display, Up to 11 Days of Battery, Black",
        "discountInfo": "35% off",
        "productLink": "https://www.amazon.ca/Garmin-v%C3%ADvoactive-Fitness-Smartwatch-Display/dp/B0CG6NR413?ref=dlx_deals_dg_dcl_B0CG6NR413_dt_sl14_f7&pf_rd_r=EBY3542VGGFJF09YVBNA&pf_rd_p=df8509bd-da04-4f0b-a4cb-a9b8a96d5cf7",
        "imageSources": [
            "https://m.media-amazon.com/images/I/61A4yOWzGBL._AC_SF226,226_QL85_.jpg?aicid=discounts-widgets-horizonte"
        ],
        "description": [
            "The Garmin vívoactive 5, Health and Fitness GPS Smartwatch, AMOLED Display, Up to 11 Days of Battery, Black is an exceptional product designed to meet your needs and exceed expectations. With a focus on innovation and performance, this product offers unparalleled features that enhance your everyday experience. Whether it's functionality, style, or cutting-edge technology, the Garmin vívoactive 5, Health and Fitness GPS Smartwatch, AMOLED Display, Up to 11 Days of Battery, Black delivers on all fronts.",
            "This product is crafted with precision, ensuring quality and durability. Its advanced capabilities make it a versatile choice, suitable for a variety of uses. With a sleek design and intuitive functionality, the Garmin vívoactive 5, Health and Fitness GPS Smartwatch, AMOLED Display, Up to 11 Days of Battery, Black integrates seamlessly into your lifestyle. Explore endless possibilities with its user-friendly interface and reliable performance.",
            "The Garmin vívoactive 5, Health and Fitness GPS Smartwatch, AMOLED Display, Up to 11 Days of Battery, Black stands out not only for its features but also for its commitment to sustainability and user satisfaction. Whether you’re at home, in the office, or on the go, this product adapts effortlessly to your environment. It's more than just a product—it's an investment in quality, convenience, and innovation."
        ]
    },
    {
        "_id": "B08K2Y2KQN__8",
        "asin": "B08K2Y2KQN",
        "deal_id": "",
        "title": "Xbox Core Wireless Gaming Controller + USB-C® Cable – Carbon Black – Xbox Series X|S, Xbox One, Windows PC, Android, and iOS - Controller + USB C Cable Edition",
        "discountInfo": "27% off",
        "productLink": "https://www.amazon.ca/Microsoft-Wireless-Controller-USB-C-Cable/dp/B08K2Y2KQN?ref=dlx_deals_dg_dcl_B08K2Y2KQN_dt_sl14_f7&pf_rd_r=EBY3542VGGFJF09YVBNA&pf_rd_p=df8509bd-da04-4f0b-a4cb-a9b8a96d5cf7",
        "imageSources": [
            "https://m.media-amazon.com/images/I/61W9ZVjqDXL._AC_SF226,226_QL85_.jpg?aicid=discounts-widgets-horizonte"
        ],
        "description": [
            "The Xbox Core Wireless Gaming Controller + USB-C® Cable – Carbon Black – Xbox Series X|S, Xbox One, Windows PC, Android, and iOS - Controller + USB C Cable Edition is an exceptional product designed to meet your needs and exceed expectations. With a focus on innovation and performance, this product offers unparalleled features that enhance your everyday experience. Whether it's functionality, style, or cutting-edge technology, the Xbox Core Wireless Gaming Controller + USB-C® Cable – Carbon Black – Xbox Series X|S, Xbox One, Windows PC, Android, and iOS - Controller + USB C Cable Edition delivers on all fronts.",
            "This product is crafted with precision, ensuring quality and durability. Its advanced capabilities make it a versatile choice, suitable for a variety of uses. With a sleek design and intuitive functionality, the Xbox Core Wireless Gaming Controller + USB-C® Cable – Carbon Black – Xbox Series X|S, Xbox One, Windows PC, Android, and iOS - Controller + USB C Cable Edition integrates seamlessly into your lifestyle. Explore endless possibilities with its user-friendly interface and reliable performance.",
            "The Xbox Core Wireless Gaming Controller + USB-C® Cable – Carbon Black – Xbox Series X|S, Xbox One, Windows PC, Android, and iOS - Controller + USB C Cable Edition stands out not only for its features but also for its commitment to sustainability and user satisfaction. Whether you’re at home, in the office, or on the go, this product adapts effortlessly to your environment. It's more than just a product—it's an investment in quality, convenience, and innovation."
        ]
    },
    {
        "_id": "B0DKDZ8117__9",
        "asin": "B0DKDZ8117",
        "deal_id": "",
        "title": "Rowing Machine, MOSUNY Magnetic Rower Machines for Home Use 350 LB Weight Capacity, 16 Levels Resistance Row Machine with Dual Slide Rail",
        "discountInfo": "46% off",
        "productLink": "https://www.amazon.ca/MOSUNY-Magnetic-Machines-Capacity-Resistance/dp/B0DKDZ8117?ref=dlx_deals_dg_dcl_B0DKDZ8117_dt_sl14_f7&pf_rd_r=EBY3542VGGFJF09YVBNA&pf_rd_p=df8509bd-da04-4f0b-a4cb-a9b8a96d5cf7",
        "imageSources": [
            "https://m.media-amazon.com/images/I/6168VM-dK8L._AC_SF226,226_QL85_.jpg?aicid=discounts-widgets-horizonte"
        ],
        "description": [
            "The Rowing Machine, MOSUNY Magnetic Rower Machines for Home Use 350 LB Weight Capacity, 16 Levels Resistance Row Machine with Dual Slide Rail is an exceptional product designed to meet your needs and exceed expectations. With a focus on innovation and performance, this product offers unparalleled features that enhance your everyday experience. Whether it's functionality, style, or cutting-edge technology, the Rowing Machine, MOSUNY Magnetic Rower Machines for Home Use 350 LB Weight Capacity, 16 Levels Resistance Row Machine with Dual Slide Rail delivers on all fronts.",
            "This product is crafted with precision, ensuring quality and durability. Its advanced capabilities make it a versatile choice, suitable for a variety of uses. With a sleek design and intuitive functionality, the Rowing Machine, MOSUNY Magnetic Rower Machines for Home Use 350 LB Weight Capacity, 16 Levels Resistance Row Machine with Dual Slide Rail integrates seamlessly into your lifestyle. Explore endless possibilities with its user-friendly interface and reliable performance.",
            "The Rowing Machine, MOSUNY Magnetic Rower Machines for Home Use 350 LB Weight Capacity, 16 Levels Resistance Row Machine with Dual Slide Rail stands out not only for its features but also for its commitment to sustainability and user satisfaction. Whether you’re at home, in the office, or on the go, this product adapts effortlessly to your environment. It's more than just a product—it's an investment in quality, convenience, and innovation."
        ]
    },
    {
        "_id": "B01M16WBW1__10",
        "asin": "B01M16WBW1",
        "deal_id": "",
        "title": "Queen Size 4 Piece Sheet Set - Comfy Breathable & Cooling Sheets - Hotel Luxury Bed Sheets for Women & Men - Deep Pockets, Easy-Fit, Extra Soft & Wrinkle Free Sheets - White Oeko-Tex Bed Sheet Set",
        "discountInfo": "63% off",
        "productLink": "https://www.amazon.ca/Queen-Size-Sheet-Set-Breathable/dp/B01M16WBW1?ref=dlx_deals_dg_dcl_B01M16WBW1_dt_sl14_f7&pf_rd_r=EBY3542VGGFJF09YVBNA&pf_rd_p=df8509bd-da04-4f0b-a4cb-a9b8a96d5cf7",
        "imageSources": [
            "https://m.media-amazon.com/images/I/71b8fh-dQ4L._AC_SF226,226_QL85_.jpg?aicid=discounts-widgets-horizonte"
        ],
        "description": [
            "The Queen Size 4 Piece Sheet Set - Comfy Breathable & Cooling Sheets - Hotel Luxury Bed Sheets for Women & Men - Deep Pockets, Easy-Fit, Extra Soft & Wrinkle Free Sheets - White Oeko-Tex Bed Sheet Set is an exceptional product designed to meet your needs and exceed expectations. With a focus on innovation and performance, this product offers unparalleled features that enhance your everyday experience. Whether it's functionality, style, or cutting-edge technology, the Queen Size 4 Piece Sheet Set - Comfy Breathable & Cooling Sheets - Hotel Luxury Bed Sheets for Women & Men - Deep Pockets, Easy-Fit, Extra Soft & Wrinkle Free Sheets - White Oeko-Tex Bed Sheet Set delivers on all fronts.",
            "This product is crafted with precision, ensuring quality and durability. Its advanced capabilities make it a versatile choice, suitable for a variety of uses. With a sleek design and intuitive functionality, the Queen Size 4 Piece Sheet Set - Comfy Breathable & Cooling Sheets - Hotel Luxury Bed Sheets for Women & Men - Deep Pockets, Easy-Fit, Extra Soft & Wrinkle Free Sheets - White Oeko-Tex Bed Sheet Set integrates seamlessly into your lifestyle. Explore endless possibilities with its user-friendly interface and reliable performance.",
            "The Queen Size 4 Piece Sheet Set - Comfy Breathable & Cooling Sheets - Hotel Luxury Bed Sheets for Women & Men - Deep Pockets, Easy-Fit, Extra Soft & Wrinkle Free Sheets - White Oeko-Tex Bed Sheet Set stands out not only for its features but also for its commitment to sustainability and user satisfaction. Whether you’re at home, in the office, or on the go, this product adapts effortlessly to your environment. It's more than just a product—it's an investment in quality, convenience, and innovation."
        ]
    },
    {
        "_id": "B0863TXGM3__11",
        "asin": "B0863TXGM3",
        "deal_id": "",
        "title": "Sony WH-1000XM4 Wireless Industry Leading Noise Canceling Overhead Headphones with Mic for Phone-Call and Alexa Voice Control, Black",
        "discountInfo": "35% off",
        "productLink": "https://www.amazon.ca/Sony-WH-1000XM4-Canceling-Headphones-WH1000XM4/dp/B0863TXGM3?ref=dlx_deals_dg_dcl_B0863TXGM3_dt_sl14_f7&pf_rd_r=EBY3542VGGFJF09YVBNA&pf_rd_p=df8509bd-da04-4f0b-a4cb-a9b8a96d5cf7",
        "imageSources": [
            "https://m.media-amazon.com/images/I/61vIICn1JOL._AC_SF226,226_QL85_.jpg?aicid=discounts-widgets-horizonte"
        ],
        "description": [
            "The Sony WH-1000XM4 Wireless Industry Leading Noise Canceling Overhead Headphones with Mic for Phone-Call and Alexa Voice Control, Black is an exceptional product designed to meet your needs and exceed expectations. With a focus on innovation and performance, this product offers unparalleled features that enhance your everyday experience. Whether it's functionality, style, or cutting-edge technology, the Sony WH-1000XM4 Wireless Industry Leading Noise Canceling Overhead Headphones with Mic for Phone-Call and Alexa Voice Control, Black delivers on all fronts.",
            "This product is crafted with precision, ensuring quality and durability. Its advanced capabilities make it a versatile choice, suitable for a variety of uses. With a sleek design and intuitive functionality, the Sony WH-1000XM4 Wireless Industry Leading Noise Canceling Overhead Headphones with Mic for Phone-Call and Alexa Voice Control, Black integrates seamlessly into your lifestyle. Explore endless possibilities with its user-friendly interface and reliable performance.",
            "The Sony WH-1000XM4 Wireless Industry Leading Noise Canceling Overhead Headphones with Mic for Phone-Call and Alexa Voice Control, Black stands out not only for its features but also for its commitment to sustainability and user satisfaction. Whether you’re at home, in the office, or on the go, this product adapts effortlessly to your environment. It's more than just a product—it's an investment in quality, convenience, and innovation."
        ]
    }
]